/***********************************************************************
 * Моля, преименувате файла, като:
 *   - замените G с групата, с която ходите на упражнения
 *   - замените F с вашия факултетен номер
 **********************************************************************/

/***********************************************************************
 Задача 1. Деца са начертали на асфалта фигура с последователно номерирани 
 полета и играят на дама със следните странни правила. Детето, започва игра 
 с n камъчета в ръка. На всяка стъпка хвърля камъче напред и избира или (1) 
 да скочи на полето с по-висок номер, на което е попаднало камъчето, без да 
 го взима, или (2) да скочи обратно на най-близкото поле с по-нисък номер, 
 от което е дошло, и да вземе камъчето там. Целта е да стигне до поле с 
 максимален номер и след това да се върне в начална позиция. Да се реализира 
 функция int findMax(int n, std::vector<int> const& play), която по подадена 
 последователност от номера на полета, на които е скочено, проверява дали 
 тази последователност спазва правилата на играта и връща максималния номер 
 на поле, на което е стъпено. Ако има нарушение на правилата, функцията да 
 връща 0. Упътване: използвайте стек, за да запазите полетата, на които е 
 стъпва детето при скок напред и да проверите дали правилно се връща по тях 
 при скок назад.
 Пример: findMax(7, {1,3,5,3,6,3,1,4,8,4,1}) ⇒ 8
 Пример: findMax(6, {1,3,5,3,6,3,1,4,8,4,1}) ⇒ 0
 Пример: findMax(6, {1,3,5,3,6,5,3,1}) ⇒ 0
 Пример: findMax(6, {1,3,5,3,6,3}) ⇒ 0
************************************************************************/

/***********************************************************************
 РЕШЕНИЕ:
************************************************************************/

#include <vector>
#include <stack>

int findMax(int n, std::vector<int> const& play) {
    std::stack<int> st;
    int max = 0;
    for (int x : play) {
        if (x > max) {
            max = x;
        }
        if (--n < 0)
            return 0;
        if (st.empty() || x > st.top())
            // скок напред
            st.push(x++);
        else {
            // скок назад
            st.pop();
            if (st.empty() || st.top() != x)
                return 0;
            ++n;
        }
    }
    if (st.empty())
        return 0;
    st.pop();
    if (!st.empty())
        return 0;
    return max;
}

/***********************************************************************
 КРАЙ НА РЕШЕНИЕТО
************************************************************************/

#define DOCTEST_CONFIG_IMPLEMENT
#include "doctest.h"

/***********************************************************************
  РАЗКОМЕНТИРАЙТЕ СЛЕДВАЩИЯ РЕД, ЗА ДА ВКЛЮЧИТЕ ТЕСТОВЕТЕ
************************************************************************/
#include "1_tests.hpp"

int main () {
    // пускане на тестовете
    doctest::Context().run();
    return 0;
}