/***********************************************************************
 * Моля, преименувате файла, като:
 *   - замените G с групата, с която ходите на упражнения
 *   - замените F с вашия факултетен номер
 **********************************************************************/

/***********************************************************************
Задача 2. Едносвързан списък от числа е представен с верига от двойни кутии от вида:
struct node { int data; node* next; }; Да се реализира функция
node* createCycle(int x, node* start), която във веригата с начало 
start намира първият елемент ai, който е по-голям от x, след което създава 
циклична верига от елементите a1,...,ai-1, x и връща като резултат остатъка 
от веригата с начало елемента ai+1. Ако няма елемент по-голям от x, функцията 
да връща start.
Пример: createCycle(4,1 → 0 → 5 → 4 → 8) ⇒ 5 → 4 → 8, а 
веригата става 1 → 0 → 4
************************************************************************/

struct node {
    int data;
    node* next;
};

/***********************************************************************
 РЕШЕНИЕ:
************************************************************************/

node* createCycle(int x, node* start);

/***********************************************************************
 КРАЙ НА РЕШЕНИЕТО
************************************************************************/

#define DOCTEST_CONFIG_IMPLEMENT
#include "doctest.h"

/***********************************************************************
  РАЗКОМЕНТИРАЙТЕ СЛЕДВАЩИЯ РЕД, ЗА ДА ВКЛЮЧИТЕ ТЕСТОВЕТЕ
************************************************************************/
//#include "2_tests.hpp"

int main () {
    // пускане на тестовете
    doctest::Context().run();
    return 0;
}