/***********************************************************************
 * Моля, преименувате файла, като:
 *   - замените G с групата, с която ходите на упражнения
 *   - замените F с вашия факултетен номер
 **********************************************************************/

/***********************************************************************
Задача 3. Разглеждаме списък от опашки от числа, в които елементите са 
подредени в монотонно нарастващ ред. Да се реализира функция, която 
прехвърля елементите на опашките, които са на четни позиции в списъка, 
в нова опашка така, че числата в нея да са подредени в монотонно 
нарастващ ред. Новата опашка да се запише на последна позиция в списъка, 
а изпразнените опашки да се изтрият от списъка. Представянето на списъка 
от опашки е по ваш избор. Бонус: използвайте шаблони, така че елементите 
да могат да са от произволен тип.
Пример:

Вход
       -2     	 
-1     -1     	 
 0      2      3      1
 3  –>  5  ->  7  ->  4

Изход
               -2
               -1
                1
 -1             2
  0      3	    4
  3  ->  7  ->  5
************************************************************************/

/***********************************************************************
 РЕШЕНИЕ:
************************************************************************/

// Разкоментирайте долния ред, ако ще правите бонуса
// template <typename T>
// Разкоментирайте долния ред като попълните предложение от вас тип за списък от опашки
// void transform(СПИСЪК_ОТ_ОПАШКИ lq);

/***********************************************************************
 КРАЙ НА РЕШЕНИЕТО
************************************************************************/

#define DOCTEST_CONFIG_IMPLEMENT
#include "doctest.h"

/***********************************************************************
  РАЗКОМЕНТИРАЙТЕ ЕДИН ОТ СЛЕДВАЩИТЕ РЕДОВЕ, ЗА ДА ВКЛЮЧИТЕ ТЕСТОВЕТЕ
************************************************************************/
// Разкоментирайте този ред, ако ползвате шаблоните от лекции
// #include "3_tests.hpp"
// Разкоментирайте този ред, ако ползвате STL
// #include "3_tests_stl.hpp"

int main () {
    // пускане на тестовете
    doctest::Context().run();
    return 0;
}