/***********************************************************************
 * Моля, преименувате файла, като:
 *   - замените G с групата, с която ходите на упражнения
 *   - замените F с вашия факултетен номер
 **********************************************************************/

/***********************************************************************
Задача 6. Разглеждаме списък от стекове от числа, в които елементите са 
подредени в монотонно нарастващ ред от върха към дъното. Да се реализира 
функция, която прехвърля елементите на стековете, които са на нечетни 
позиции в списъка, в нов стек така, че числата в него да са подредени в 
монотонно намаляващ ред от върха към дъното. Новият стек да се запише на 
първа позиция в списъка, а изпразнените стекове да се изтрият от списъка. 
Представянето на списъка от стекове е по ваш избор.
Бонус: използвайте шаблони, така че елементите да могат да са от произволен 
тип.
Пример:

Вход
                4	 
 3              2      7
 2      3       0      4
 1  –>  0  ->  -1  ->  0

Изход
 -1              
  0             
  1             
  2             
  2      	    7
  3      3      4
  4  ->  0  ->  0
************************************************************************/

/***********************************************************************
 РЕШЕНИЕ:
************************************************************************/

// Разкоментирайте долния ред, ако ще правите бонуса
// template <typename T>
// Разкоментирайте долния ред като попълните предложение от вас тип за списък от стекове
// void transform(СПИСЪК_ОТ_СТЕКОВЕ ls);

/***********************************************************************
 КРАЙ НА РЕШЕНИЕТО
************************************************************************/

#define DOCTEST_CONFIG_IMPLEMENT
#include "doctest.h"

/***********************************************************************
  РАЗКОМЕНТИРАЙТЕ ЕДИН ОТ СЛЕДВАЩИТЕ РЕДОВЕ, ЗА ДА ВКЛЮЧИТЕ ТЕСТОВЕТЕ
************************************************************************/
// Разкоментирайте този ред, ако ползвате шаблоните от лекции
// #include "6_tests.hpp"
// Разкоментирайте този ред, ако ползвате STL
// #include "6_tests_stl.hpp"

int main () {
    // пускане на тестовете
    doctest::Context().run();
    return 0;
}